from random import randrange as rr
list1 = sorted([rr(100) for n in range(rr(2,40))])
list2 = sorted([rr(100) for n in range(rr(2,40))])
print(f'list1 =\n {list1}\n'
      f'list2 =\n {list2}\n'
      f'\nБез пересекающихся элементов:')
print(f'list1 без элементов списка list2 =\n'
      f'{sorted(list(set(list1) - set(list2))) if set(list1) & set(list2) else list1}\n'
      f'list2 без элементов списка list1 =\n'
      f'{sorted(list(set(list2) - set(list1))) if set(list2) & set(list1) else list2}')
      
#Вывод
list1 =
 [2, 3, 4, 7, 8, 9, 14, 17, 17, 31, 33, 35, 38, 39, 40, 45, 48, 50, 52, 54, 57, 63, 65, 65, 65, 68, 70, 70, 77, 79, 79, 81, 85, 92, 93, 94, 95, 97]
list2 =
 [0, 0, 2, 2, 5, 5, 6, 7, 13, 15, 15, 17, 18, 24, 25, 28, 36, 37, 37, 41, 41, 43, 43, 47, 54, 54, 54, 55, 56, 66, 74, 76, 85, 87, 91, 95, 96, 96]

Без пересекающихся элементов:
list1 без элементов списка list2 =
[3, 4, 8, 9, 14, 31, 33, 35, 38, 39, 40, 45, 48, 50, 52, 57, 63, 65, 68, 70, 77, 79, 81, 92, 93, 94, 97]
list2 бе� элементов списка list1 =
[0, 5, 6, 13, 15, 18, 24, 25, 28, 36, 37, 41, 43, 47, 55, 56, 66, 74, 76, 87, 91, 96]




